"""
Створіть масив зі строками, які будуть складатися з чисел, які розділені комою.
Наприклад: [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи,
що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
Використовуйте блок tryexcept, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”
"""
my_list = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]

def sum_elements(item):
    total = 0
    elements = item.split(",")
    try:
        for item in elements:
            total += int(item)
        return total
    except ValueError:
        return "Не можу це зробити!"

for i in my_list:
    result = sum_elements(i)
    print(result)