"""Порахувати кількість унікальних символів в строці.
Якщо їх більше 10 - вивести в консоль True, інакше - False.
Строку отримати за допомогою функції input()

Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
Ви можете перевірити це в інкогніто-режимі вашого браузера.
Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код."""

print('-' * 20 + ' Solution ' + '-' * 20)

some_string = input()
set_comp = set(some_string)
if len(set_comp) > 10:
    print(True)
else:
    print(False)
